In [12]:
from datetime import datetime
import pandas as pd

In [4]:
print(datetime.now())

2020-06-18 02:23:26.968514

In [5]:
print(datetime.today())

2020-06-18 02:23:39.280211

In [6]:
t1 = datetime.now()
t2 = datetime(1970, 1, 1)
t3 = datetime(1970, 12, 12, 13, 24, 24)

print(t1)
print(t2)
print(t3)

2020-06-18 02:28:55.861573
1970-01-01 00:00:00
1970-12-12 13:24:24

In [8]:
diff = t1-t2
print(diff)

18431 days, 2:28:55.861573

In [10]:
diff2 = t2-t1
print(diff2)

-18432 days, 21:31:04.138427

In [14]:
test_df1 = pd.DataFrame({'order_day': ['01/01/15','02/01/15','03/01/15']})
test_df1

  order_day
0  01/01/15
1  02/01/15
2  03/01/15

In [21]:
test_df2 = pd.DataFrame({'order_day': ['99/01/15','98/01/15','97/01/15']})
test_df2

  order_day
0  99/01/15
1  98/01/15
2  97/01/15

In [18]:
test_df1['date_dt1'] = pd.to_datetime(test_df1['order_day'], format='%d/%m/%y')
print(test_df1.dtypes)
test_df1

order_day            object
date_dt1     datetime64[ns]
dtype: object

  order_day   date_dt1
0  01/01/15 2015-01-01
1  02/01/15 2015-01-02
2  03/01/15 2015-01-03

In [19]:
test_df1['date_dt1'] = pd.to_datetime(test_df1['order_day'], format='%m/%d/%y')
print(test_df1.dtypes)
test_df1

order_day            object
date_dt1     datetime64[ns]
dtype: object

  order_day   date_dt1
0  01/01/15 2015-01-01
1  02/01/15 2015-02-01
2  03/01/15 2015-03-01

In [20]:
test_df1['date_dt1'] = pd.to_datetime(test_df1['order_day'], format='%y/%m/%d')
print(test_df1.dtypes)
test_df1

order_day            object
date_dt1     datetime64[ns]
dtype: object

  order_day   date_dt1
0  01/01/15 2001-01-15
1  02/01/15 2002-01-15
2  03/01/15 2003-01-15

In [22]:
test_df2['date_dt1'] = pd.to_datetime(test_df2['order_day'], format='%y/%m/%d')
print(test_df2.dtypes)
test_df2

order_day            object
date_dt1     datetime64[ns]
dtype: object

  order_day   date_dt1
0  99/01/15 1999-01-15
1  98/01/15 1998-01-15
2  97/01/15 1997-01-15